# InvalidSelectionThereCannotBeOpenConnectors Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..InvalidSelectionThereCannotBeOpenConnectors Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Invalid selection there cannot be any open connectors for the design to fabrication part tool.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSelectionThereCannotBeOpenConnectors { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSelectionThereCannotBeOpenConnectors As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSelectionThereCannotBeOpenConnectors {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace